In [1]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import mysql.connector
import seaborn as sns
%matplotlib inline

In [2]:
user_name = os.environ.get('DB_USER')
password = os.environ.get('DB_PASS')

In [3]:
connection = mysql.connector.connect(host = 'localhost',
                                    user = 'root',
                                    passwd = 'Marcelo@21',
                                    db = 'my_db')

In [4]:
connection

In [5]:
emp_table = pd.read_sql_query('SHOW TABLES FROM my_db', connection)

In [6]:
emp_table

   Tables_in_my_db
0       categories
1            pivot
2           sample
3          sample1
4          sample2
5         sample_1
6         sample_2
7     sampleinput1
8     sampleinput2
9    sampleinput_1
10   sampleinput_2
11              t1

In [7]:
tables = emp_table['Tables_in_my_db']

In [8]:
tables

0        categories
1             pivot
2            sample
3           sample1
4           sample2
5          sample_1
6          sample_2
7      sampleinput1
8      sampleinput2
9     sampleinput_1
10    sampleinput_2
11               t1
Name: Tables_in_my_db, dtype: object

In [9]:
for table_name in tables:
    output = pd.read_sql_query('DESCRIBE {}'.format(table_name), connection)
    print(table_name)
    print(output, '\n')

categories
        Field             Type Null  Key               Default  \
0          id           b'int'   NO  PRI                  None
1        name  b'varchar(255)'   NO                       None
2  created_at     b'timestamp'  YES       b'CURRENT_TIMESTAMP'

               Extra
0     auto_increment
1
2  DEFAULT_GENERATED

pivot
            Field            Type Null Key Default Extra
0       System_ID          b'int'   NO        None
1   Property_Name  b'varchar(50)'   NO        None
2  Property_Value  b'varchar(50)'   NO        None

sample
       Field          Type Null  Key Default Extra
0  System_ID        b'int'   NO  PRI    None
1  Timestamp  b'timestamp'  YES         None
2    Release      b'float'  YES         None

sample1
        Field            Type Null Key Default Extra
0   System_ID          b'int'   NO        None
1       Event  b'varchar(50)'   NO        None
2  Occurrence          b'int'   NO        None

sample2
        Field            Type Null Key Default Extra
0   System_ID          b'int'   NO        None
1       Event  b'varchar(50)'   NO        None
2  Occurrence          b'int'   NO        None

sample_1
        Field            Type Null Key Default Extra
0   System_ID          b'int'   NO        None
1       Event  b'varchar(50)'   NO        None
2  Occurrence          b'int'   NO        None

sample_2
        Field            Type Null Key Default Extra
0   System_ID          b'int'   NO        None
1       Event  b'varchar(50)'   NO        None
2  Occurrence          b'int'   NO        None

sampleinput1
        Field          Type Null  Key Default Extra
0   System_ID        b'int'   NO  PRI    None
1       Event  b'timestamp'  YES         None
2  Occurrence        b'int'  YES         None

sampleinput2
        Field          Type Null  Key Default Extra
0   System_ID        b'int'   NO  PRI    None
1       Event  b'timestamp'  YES         None
2  Occurrence        b'int'  YES         None

sampleinput_1
        Field            Type Null  Key Default Extra
0   System_ID          b'int'   NO  PRI    None
1       Event  b'varchar(50)'   NO         None
2  Occurrence          b'int'   NO         None

sampleinput_2
        Field            Type Null Key Default Extra
0   System_ID          b'int'   NO        None
1       Event  b'varchar(50)'   NO        None
2  Occurrence          b'int'   NO        None

t1
  Field            Type Null Key Default Extra
0     t      b'time(3)'  YES        None
1    dt  b'datetime(6)'  YES        None

In [10]:
sys_id = 'SELECT System_ID, Event, Occurrence\
          FROM sampleinput_2'

In [11]:
df = pd.read_sql_query(sys_id, connection)

In [12]:
df

    System_ID     Event  Occurrence
0         100    Hangup          25
1         100    Hangup          25
2         104     Abort          54
3         102  HW_error           1
4         101    Hiccup          34
5         101     Abort          65
6         100     Crash          26
7         100    Hangup          25
8         104     Abort          54
9         102  HW_error           1
10        101    Hiccup          34
11        101     Abort          65
12        100     Crash          26

In [13]:
sampleinput_2 = 'SELECT * FROM sampleinput_2'

In [14]:
df2 = pd.read_sql_query(sampleinput_2, connection)

In [15]:
df2

    System_ID     Event  Occurrence
0         100    Hangup          25
1         100    Hangup          25
2         104     Abort          54
3         102  HW_error           1
4         101    Hiccup          34
5         101     Abort          65
6         100     Crash          26
7         100    Hangup          25
8         104     Abort          54
9         102  HW_error           1
10        101    Hiccup          34
11        101     Abort          65
12        100     Crash          26

In [16]:
df2.groupby(['Event','Occurrence'])['System_ID'].count()

Event     Occurrence
Abort     54            2
          65            2
Crash     26            2
HW_error  1             2
Hangup    25            3
Hiccup    34            2
Name: System_ID, dtype: int64